kinton/nrf52_expirements/ble_app_uart_non_fs/main.c
            // just hashing
            if (false) {
            err_code = sha256_update(&ctx, readed_data, length);
            APP_ERROR_CHECK(err_code);
            
            memset(readed_data, 0, sizeof(readed_data));
            err_code = sha256_final(&ctx, readed_data, 0);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Hashed: \"%s\"", readed_data);
            
            length = 32;
            err_code = ble_nus_data_send(&m_nus, readed_data, &length, m_conn_handle);
            APP_ERROR_CHECK(err_code);
            }*/
}
static void write_from_handler(void) {
            ret_code_t err_code;
            // static char     m_hello_world[] = "hello world";
            static char msg_to_write[tokenlen];
            
            memset(msg_to_write, 0, sizeof msg_to_write);
            for (uint32_t i = 0; i < mh_len; i++)
            {
                msg_to_write[i] = message_handler[i];
                // if (i == 255) break;
            }

            err_code = nrf_fstorage_write(&fstorage, tokenstart, msg_to_write, sizeof(msg_to_write), NULL);
            APP_ERROR_CHECK(err_code);
            NRF_LOG_INFO("Writed");
}
static bool get_token_write_status(void) {
            ret_code_t err_code;
            uint8_t readed_data[tokenlen] = {0};

            err_code = nrf_fstorage_read(&fstorage, tokenstart, readed_data, tokenlen);
            APP_ERROR_CHECK(err_code);
            
            bool is_token = false;
            for (int i = 0; i < tokenlen; i++) {
                if (readed_data[i] != 0xff) {
                    is_token = true;
                    break;
                }
            }

            return is_token;
}
static void send_command_answer(ble_command_answer ca) {
            ret_code_t err_code;
            uint16_t length = 1;
            uint8_t data_to_send[length];
            memset(data_to_send, ca, sizeof(data_to_send));
            err_code = ble_nus_data_send(&m_nus, data_to_send, &length, m_conn_handle);
            APP_ERROR_CHECK(err_code);
}
static void send_device_id() {
            ret_code_t err_code;
            const int device_id_len = 8;
            uint8_t    device_id[device_id_len];
            
            int handler = NRF_FICR->DEVICEID[0];
            for (int i = 0; i < device_id_len / 2; i++) {
                device_id[device_id_len / 2 - 1 - i] = handler;
                handler = handler / (16 * 16) - 1;
            }
            handler = NRF_FICR->DEVICEID[1];
            for (int i = 0; i < device_id_len / 2; i++) {
                device_id[device_id_len - 1 - i] = handler;
                handler = handler / (16 * 16) - 1;
            }
            /*NRF_LOG_INFO("DEVICEID0: %08X\n", NRF_FICR->DEVICEID[0]);
            NRF_LOG_INFO("DEVICEID1: %08X\n", NRF_FICR->DEVICEID[1]);
            for (int i = 0; i < device_id_len; i++)
              NRF_LOG_INFO("DEVICEID: %x", device_id[i]);
            NRF_LOG_INFO("\nDEVICEID_TEXT: %s\n", device_id);*/
            //device_id = NRF_FICR->DEVICEID[0] + NRF_FICR->DEVICEID[1];

            uint16_t length = sizeof(device_id);
            // uint16_t length = device_id_len;

            err_code = ble_nus_data_send(&m_nus, device_id, &length, m_conn_handle);
            APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        current_work_mode = command_processing;

        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS. Writing data on UART.");
        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        
        NRF_LOG_HEXDUMP_INFO(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        
        // if (p_evt->params.rx_data.p_data[0] == 113) { // == q, 71 in hex
        //     get_and_send_token();
        // }

        NRF_LOG_INFO("rx_data_len: %d", p_evt->params.rx_data.length);
        
        /* uint16_t length = p_evt->params.rx_data.length;
        uint8_t data_array[p_evt->params.rx_data.length];
        // static char data_array_to_mem[256];
        // for (unsigned char i = 0; i < 256; i++) {
        //     data_array_to_mem = 0x0;
        // }
        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            data_array[i] = p_evt->params.rx_data.p_data[i];
            // data_array_to_mem[i] = p_evt->params.rx_data.p_data[i];
        }
        // uint8_t data_array[15] = {'1', '2'};
        // uint16_t length = 15;
        // err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
        // APP_ERROR_CHECK(err_code);*/

        for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
        {
            do
            {
                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                {
                    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                    APP_ERROR_CHECK(err_code);
                }
            } while (err_code == NRF_ERROR_BUSY);
        }
        if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        {
            while (app_uart_put('\n') == NRF_ERROR_BUSY);
        }

        
        ble_command_answer ca;
        // if not empty
        if (p_evt->params.rx_data.length < 1) {
            ca = empty;
            send_command_answer(ca);

            return;
        }

        // get cmd and processing
        ble_command cmd = p_evt->params.rx_data.p_data[0];
        
        if (cmd == is_token_writed)
        {
            bool is_token = get_token_write_status();
            ca = is_token ? ok : bad;
            send_command_answer(ca);
        }
        else if (cmd == ask_for_token)
        {
            read_and_send(tokenstart);
        }
        else if (cmd == ask_for_device_id)
        {
            send_device_id();
        }
        
    } else if (p_evt->type == BLE_NUS_EVT_RX_TOKEN_DATA) {
        current_work_mode = token_write_and_check;

        uint32_t err_code;
        
        bool is_token = get_token_write_status();
        if (is_token) {
          // bit amount setup
          if (mh_len == 0)
              mh_len = maxlenoverble;
          uint8_t    readed_data[mh_len];
          uint16_t length = sizeof(readed_data);
          err_code = nrf_fstorage_read(&fstorage, tokenstart, readed_data, length);
          APP_ERROR_CHECK(err_code);
          uint8_t dict[36] = "0123456789abcdefghigklmnopqrstuvwxyz";

          // write ble data to m_h, saving his len to mh_len
          memset(message_handler, 0, sizeof message_handler);
          for (mh_len = 0; mh_len < p_evt->params.rx_data.length; mh_len++)
          {   
              // byte sum performing
              message_handler[mh_len] = dict[(p_evt->params.rx_data.p_data[mh_len] ^ readed_data[mh_len]) % 36];
              // message_handler[mh_len] = p_evt->params.rx_data.p_data[mh_len];
              if (mh_len == maxlenoverble) break;
          }
          // NRF_LOG_INFO("Old: %s\n", readed_data);
          // NRF_LOG_INFO("New': %s\n", p_evt->params.rx_data.p_data);
          // NRF_LOG_INFO("New: %s\n", message_handler);
        } else {
          memset(message_handler, 0, sizeof message_handler);
          for (mh_len = 0; mh_len < p_evt->params.rx_data.length; mh_len++)
          {   
              message_handler[mh_len] = p_evt->params.rx_data.p_data[mh_len];
              if (mh_len == maxlenoverble) break;
          }
        }

        // clean token page, start echo in fstorage handler
        err_code = nrf_fstorage_erase(&fstorage, tokenstart, 1, NULL);
        APP_ERROR_CHECK(err_code);
    }
}


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

